class MorningVideosLinks {
  static getVideoLinks(value) {
    switch (value) {
      case 1:
        return "https://youtu.be/L3-NXDZ3qBA";
        break;
      case 2:
        return "https://youtu.be/TbHVOEOaUBY";
        break;
      case 3:
        return "https://youtu.be/xWFdHS3zIQ0";
        break;
      case 4:
        return "https://youtu.be/WBKJh0eIsmE";
        break;
      case 5:
        return "https://youtu.be/fNJm8vZQKvI";
        break;
      case 6:
        return "https://youtu.be/Ov4JHKw6qT0";
        break;
      case 7:
        return "https://youtu.be/EVwN2FZ3d-I";
        break;
      case 8:
        return "https://youtu.be/LqxoaDoS-So";
        break;
      case 9:
        return "https://youtu.be/NnW1v5kMHxw";
        break;
      case 10:
        return "https://youtu.be/FiDGiHo6gx8";
        break;
      case 11:
        return "https://youtu.be/6xe7mA2TS0o";
        break;
      case 12:
        return "https://youtu.be/TSl7wkg1Oaw";
        break;
      case 13:
        return "https://youtu.be/H30Ej-EpZ5k";
        break;
      case 14:
        return "https://youtu.be/tBfebBq1VlM";
        break;
      case 15:
        return "https://youtu.be/BGKvzcwazFo";
        break;
      case 16:
        return "https://youtu.be/wayCUuZbLT8";
        break;
      case 17:
        return "https://youtu.be/wu6tAbMQrT8";
        break;
      case 18:
        return "https://youtu.be/rn-lSWgiCnE";
        break;
      case 19:
        return "https://youtu.be/5ACwSSLF9K8";
        break;
      case 20:
        return "https://youtu.be/vPnbLB4uQkQ";
        break;
      case 21:
        return "https://youtu.be/OGOGHz8O8eM";
        break;
      case 22:
        return "https://youtu.be/l4shSVN37LQ";
        break;
      case 23:
        return "https://youtu.be/5u4eu6ozWEE";
        break;
      case 24:
        return "https://youtu.be/yPH9EIVWkKs";
        break;
    }
  }
}

class EveingVideosLinks {
  static getVideoLinks(value) {
    switch (value) {
      case 1:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 2:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 3:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 4:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 5:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 6:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 7:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 8:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 9:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 10:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 11:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 12:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 13:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 14:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 15:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 16:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 17:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 18:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 19:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 20:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 21:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 22:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 23:
        return "https://youtu.be/pENNWn78lBc";
        break;
      case 24:
        return "https://youtu.be/pENNWn78lBc";
        break;
    }
  }
}

class MovieLinks {
  Map _morningMovieLinks = {
    1: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    },
    2: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    },
    3: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    },
    4: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    },
    5: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    }
  };
  Map _eveningMovieLinks = {
    1: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    },
    2: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    },
    3: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    },
    4: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    },
    5: {
      1: "#024 　もし、もう一度やり直しが出来るならば…　 …【行動力 : 課題発見力】",
      2: "#012 　問題は発生と同時に答えを背負っている 答えは自分の中にある　 …【行動力 : 課題発見力】",
      3: "#041 　偉人はみな考える！一日一回思考する！！　 …【行動力 : 課題発見力】",
      4: "#244 イノベーションシリーズ　問題より、解決策にフォーカスする　 …【行動力 : 課題発見力】",
      5: "#231 　前提を疑う　エディー・ジョーンズ …【行動力 : 課題発見力】",
      6: "#064 　その心は？　 …【行動力 : 課題発見力】",
      7: "#228 　本質を追求する　 …【行動力 : 課題発見力】",
      8: "#318 　逆転の発想でパフォーマンスアップ　 …【行動力 : 課題発見力】",
      8.5: "課題発見力振返り",
      9: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      10: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      11: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      12: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      13: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      14: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      15: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16: "#245 イノベーションシリーズ　たくさんの褒美を用意しておく　 …【行動力 : やりきる力】",
      16.5: "やりきる力振返り",
      17: "#116 　イノベーション＝イミテーション+イマジネーション　 …【行動力 : 創造力・01力】",
      18: "#014 　未来を願うならあなた自身が望む未来になりなさい　 …【行動力 : 創造力・01力】",
      19: "#210 　最終学歴を最新学歴に更新する　 …【行動力 : 創造力・01力】",
      20: "#316 　時代を感じてパフォーマンスアップ　 …【行動力 : 創造力・01力】",
      21: "#327 　インプットの量を増やして　ひらめき　アップ！　 …【行動力 : 創造力・01力】",
      22: "#211 　シンギュラリティに備える　 …【行動力 : 創造力・01力】",
      23: "#230 　ゆでガエルになるな！　 …【行動力 : 創造力・01力】",
      24: "#301 メンタルトレーニングで幸せを高める！シリーズ　４つの未来を描いて自己実現意欲アップ　 …【行動力 : 創造力・01力】",
      24.5: "創造力振返り",
    }
  };
}
